Revit 2027 API
BoundingBoxIntersectsFilter(Outline) Constructor
 Constructs a new instance of a filter to match elements with a bounding box that intersects the given Outline.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BoundingBoxIntersectsFilter(
	Outline outline
)
Public Sub New (
	outline As Outline
)
public:
BoundingBoxIntersectsFilter(
	Outline^ outline
)
new :
        outline : Outline -> BoundingBoxIntersectsFilter
Parameters
outline Outline
 The Outline used to find elements with a bounding box that intersect it.
Exceptions
Exception | Condition
ArgumentException |  outline is an empty Outline.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
BoundingBoxIntersectsFilter Class
BoundingBoxIntersectsFilter Overload
Autodesk.Revit.DB Namespace